In [1]:
import sqlite3

In [2]:
conn=sqlite3.connect('experiment-2.db')
cur=conn.cursor()
print ("Opened database successfully");

Opened database successfully

In [3]:
conn.execute('''CREATE TABLE COMPANY1
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print ("Table created successfully");

Table created successfully

In [4]:
conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Ruchitha', 32, 'India', 20000.00 )");

conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Diya', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Rishi', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Jyoshna', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()
print ("Records created successfully");

Records created successfully

In [5]:
for row in conn.execute('select * from COMPANY1'):
        print(row)

(1, 'Ruchitha', 32, 'India', 20000.0)
(2, 'Diya', 25, 'Texas', 15000.0)
(3, 'Rishi', 23, 'Norway', 20000.0)
(4, 'Jyoshna', 25, 'Rich-Mond ', 65000.0)

In [6]:
conn.commit()

In [7]:
conn.close()